<!-- 对上述路由搭建的小项目进行流程分析：
首先运行npm run dev指令可以首先将vite执行，导致启动index.html文件，并且在index.html文件中的<script type="module" src="/src/main.ts"></script>
标签上的src属性将main.ts脚本进行引入，在main.ts中首先从vue包中导入创建应用的方法，并且从App.vue文件中引入枝文件，并且使用引入的创建引用的方法
将引入的App.vue组件实例化为应用对象，并且引入了路由器，在路由器文件本质为index.ts文件，其中执行了创建路由器以及引入各个路由对应的组件，并且创建路由器
（在路由器中绑定上各个路由）最终将路由器对象进行暴露，而后在App.vue文件中执行app.use()方法对路由器进行使用(若不使用则引入的路由器则无效，同时vue插件上无法
观测到routes目录)，而后使用app.mount()方法对index.html文件中指定挂载的标签对象的选择器进行指定，并完成内容的嵌套挂载
-->

<!-- 此处为了验证第二个注意点，则此处在About.vue文件中使用对应的生命周期钩子用于显示每次进行组件的切换走和切换来的时候，是否本身发生了
卸载和挂载;再设置好了对应的生命周期函数之后，根据切换不同的路由呈现出来的效果可以得出：每当全换为别的组件的时候，首先进行当前组件的卸载，
后执行别的组件的挂载
-->

